local alpha = require("alpha")
local dashboard = require("alpha.themes.dashboard")
local datetime = os.date(" %H:%M. ")

dashboard.section.header.val = {
"                             ,;;'''';;,                    ,;;;;,",
"                   ,        ;;'      `;;,               .,;;;'   ;",
"                ,;;;       ;;          `;;,';;;,.     ,%;;'     '",
"              ,;;,;;       ;;         ,;`;;;, `;::.  %%;'",
"             ;;;,;;;       `'       ,;;; ;;,;;, `::,%%;'",
"             ;;;,;;;,          .,%%%%%'% ;;;;,;;   %;;;",
"   ,%,.      `;;;,;;;,    .,%%%%%%%%%'%; ;;;;;,;;  %;;;",
"  ;,`%%%%%%%%%%`;;,;;'%%%%%%%%%%%%%'%%'  `;;;;;,;, %;;;",
"  ;;;,`%%%%%%%%%%%,; ..`%%%%%%%%;'%%%'    `;;;;,;; %%;;",
"   `;;;;;,`%%%%%,;;/, .. `''''',%%%%%      `;;;;;; %%;;,",
"      `;;;;;;;,;;/////,.    ,;%%%%%%%        `;;;;,`%%;;",
"             ;;;/%%%%,%///;;;';%%%%%%,          `;;;%%;;,",
"            ;;;/%%%,%%%%%/;;;';;'%%%%%,             `%%;;",
"           .;;/%%,%%%%%//;;'  ;;;'%%%%%,             %%;;,",
"           ;;//%,%%%%//;;;'   `;;;;'%%%%             `%;;;",
"           ;;//%,%//;;;;'      `;;;;'%%%              %;;;,",
"           `;;//,/;;;'          `;;;'%%'              `%;;;",
"             `;;;;'               `;'%'                `;;;;",
"                                    '      .,,,.        `;;;;",
"                                        ,;;;;;;;;;;,     `;;;;",
"                                       ;;;'    ;;;,;;,    `;;;;",
"                                       ;;;      ;;;;,;;.   `;;;;",
"                                        `;;      ;;;;;,;;   ;;;;",
"                                          `'      `;;;;,;;  ;;;;",
"                                                     `;;,;, ;;;;",
"                                                        ;;, ;;;;",
"                                                          ';;;;;",
" ░░░█░█░█▀▀░█▀▄░█▀█░░░█▀█░█░█░▀█▀░█▄█░░░                  ;;;;;",
"  ░░░█░░█▀▀░█▀▄░█░█░░░█░█░▀▄▀░░█░░█░█░░░░                 .;;;;'",
"   ░░▀░░▀▀▀░▀░▀░▀▀▀░░░▀░▀░░▀░░▀▀▀░▀░▀░░░░░               .;;;;'",
"                                                        ;;;;;'",
"                                                       ,;;;;'",
}

dashboard.section.footer.val = { "It's" .. datetime .. "Why did you come here.", }

dashboard.section.buttons.val = {
    dashboard.button( "e", "  > New file" , ":ene <BAR> startinsert <CR>"),
    dashboard.button( "f", "󰱼  > Find file", ":cd $HOME/Workspace | Telescope find_files<CR>"),
    dashboard.button( "r", "  > Recent"   , ":Telescope oldfiles<CR>"),
    dashboard.button( "s", "  > Settings" , ":e ~/.config/nix-conf/packages/home-manager/nvim/init.lua | split . | wincmd k | pwd<CR>"),
    dashboard.button( "q", "󰈆  > Quit NVIM", ":qa<CR>"),
}

alpha.setup(dashboard.opts)
